// VM层
var vm = new Vue({
    el: "#products",

    methods: {
        showContent2(i, j){

            this.currentIndex = [i, j, false]
            this.currentPageTitle = this.Nav2[i][j].replace(/（\d+）/g,"")
            this.currentTitle = this.Nav1[i] + " > " + this.Nav2[i][j] + " > "

        },
        showContent3(i, j, k){
            this.currentIndex = [i, j, k]
            this.currentTitle = this.Nav1[i] + " > " + this.Nav2[i][j] + this.Nav3[i][j][k] + " > "
            this.currentPageTitle = this.Nav3[i][j][k].split("（")[0]
        },
        showProductList(){
            return this.productsList1[this.currentIndex[0]][this.currentIndex[1]].slice(2)
        }
    },

    data: {

        currentIndex: [0, 0, false],
        currentTitle: "酶联免疫试剂盒 > 免疫效果监测系列（8） > ",
        currentPageTitle: "免疫效果监测系列",
        content_title: ["酶联免疫试剂盒", "质控品"],
        // Nav的所有字段
        Nav1: ["酶联免疫试剂盒", "质控品"],
        Nav2: [
            ["免疫效果监测系列（8）", " TORCH系列（13）", " 儿童疾病系列（54）", " 皮肤性病系列（5）", " 疱疹病毒系列（12）", " 呼吸道疾病系列（38）", " 胃肠道疾病系列（15）", " 鼻咽癌相关病毒系列（6）", " 人畜共患系列（20）", " 虫媒传染系列（6）", " 衣原体感染系列（6）", " 真菌感染系列（7）", "IgG抗体亲和力检测", "类风湿因子吸附剂"],
            ["免疫效果监测系列（13）", " TORCH系列（13）", " 儿童疾病系列（47）", " 皮肤性病系列（7）", " 疱疹病毒系列（10）", " 呼吸道疾病系列（34）", " 胃肠道疾病系列（15）", "鼻咽癌相关病毒系列（4）", " 人畜共患系列（17）", " 虫媒传染系列（2）", " 衣原体感染系列（6）", "真菌感染系列（7）"]
        ],
        Nav3: [

            // + 酶联免疫试剂盒
            [
                // + 免疫效果监测系列
                ["百日咳杆菌", "白喉杆菌", "麻疹病毒", "腮腺炎病毒", "风疹病毒", "破伤风杆菌", "水痘-带状疱疹病毒"],
                //   + TORCH系列（13）
                ["弓形虫", "风疹病毒", "巨细胞病毒", "单纯疱疹病毒"],
                //   + 儿童疾病系列（56）
                ["百日咳杆菌", "白喉杆菌", "破伤风杆菌", "麻疹病毒", "风疹病毒", "腮腺炎病毒", "细小病毒B19", "水痘-带状疱疹病毒", "流感病毒", "EB病毒", "呼吸道合胞病毒", "柯萨奇病毒", "埃可病毒", "肠道病毒", "副流感病毒", "肺炎衣原体", "肺炎支原体", "腺病毒", "空肠弯曲杆菌"],
                //   + 皮肤性病系列
                ["单纯疱疹病毒"],
                //   + 疱疹病毒系列（12）
                ["单纯疱疹病毒1型", "单纯疱疹病毒2型", "单纯疱疹病毒1+2型", "水痘-带状疱疹病毒", "巨细胞病毒"],
                //   + 呼吸道疾病系列（39）
                ["呼吸道合胞病毒", "肺炎衣原体", "肺炎支原体", "腺病毒", "嗜肺军团菌", "流感病毒", "柯萨奇病毒", "埃可病毒", "百日咳杆菌", "肠道病毒", "Q热立克次氏体", "副流感病毒"],
                //   + 胃肠道疾病系列（15）
                ["空肠弯曲杆菌", "柯萨奇病毒", "埃可病毒", "肠道病毒", "幽门螺旋杆菌"],
                //   + 鼻咽癌相关病毒系列
                ["EB病毒"],
                //   + 人畜共患系列（20）
                ["伯氏疏螺旋体", "布鲁氏杆菌", "空肠弯曲杆菌", "Q热立克次氏体", "棘球绦虫", "土拉热弗朗西丝氏菌", "蜱传脑炎病毒", "钩端螺旋体", "弓形虫", "利什曼原虫"],
                //   + 虫媒传染系列
                ["土拉热弗朗西丝氏菌", "蜱传脑炎病毒", "登革热病毒"],
                //   + 衣原体感染系列
                ["肺炎衣原体", "沙眼衣原体"],
                //   + 真菌感染系列
                ["烟曲霉菌", "白色念珠菌"],
                //   + IgG抗体亲和力检测
                [],
                // + 类风湿因子吸附剂
                []
            ],
            // 质控品
            [
                // 免疫效果监测系列（13）
                ["百日咳杆菌", "白喉杆菌", "麻疹病毒", "腮腺炎", "风疹病毒", "破伤风杆菌", "水痘-带状疱疹病毒"],
                // TORCH系列（13）
                ["弓形虫", "风疹病毒", "巨细胞病毒", "单纯疱疹病毒"],
                // 儿童疾病系列（47）
                ["百日咳杆菌", "白喉杆菌", "破伤风杆菌", "麻疹病毒", "风疹病毒", "腮腺炎病毒", "细小病毒B19", "水痘-带状疱疹病毒", "流感病毒", "EB病毒", "呼吸道合胞病毒", "柯萨奇病毒", "埃可病毒", "肠道病毒", "副流感病毒", "肺炎衣原体", "肺炎支原体", "腺病毒", "空肠弯曲杆菌"],
                // 皮肤性病系列
                ["单纯疱疹病毒"],
                // 疱疹病毒系列（10）
                ["单纯疱疹病毒1型", "单纯疱疹病毒2型", "单纯疱疹病毒1+2型", "水痘-带状疱疹病毒", "巨细胞病毒"],
                // 呼吸道疾病系列（34）
                ["呼吸道合胞病毒", "肺炎衣原体", "肺炎支原体", "腺病毒", "嗜肺军团菌", "流感病毒", "柯萨奇病毒", "埃可病毒", "百日咳杆菌", "肠道病毒", "Q热立克次氏体", "副流感病毒"],
                // 胃肠道疾病系列（15）
                ["空肠弯曲杆菌", "柯萨奇病毒", "埃可病毒", "肠道病毒", "幽门螺旋杆菌"],
                // 鼻咽癌相关病毒系列
                ["EB病毒"],
                // 人畜共患系列（17）
                ["伯氏疏螺旋体", "布鲁氏杆菌", "空肠弯曲杆菌", "Q热立克次氏体", "棘球绦虫", "蜱传脑炎病毒", "钩端螺旋体", "弓形虫"],
                // 虫媒传染系列
                ["蜱传脑炎病毒"],
                // 衣原体感染系列
                ["肺炎衣原体", "沙眼衣原体"],
                // 真菌感染系列
                ["烟曲霉菌", "白色念珠菌"]
            ]
        ],

        /** 产品列表 **/
        // 产品背景
        // 注意事项
        // 产品信息
        productsList1: [
            // 0酶联免疫试剂盒
            [
                // 免疫效果监测系列（8）
                [
                    ["预防接种是预防和控制传染病最经济、最有效的手段。但是接种疫苗并非100%产生抗体，接种后体内抗体水平也会逐渐下降。<br />" +
                    "因此，通过对抗体水平的动态监测，能够及时了解疫苗接种效果，进行疫苗查漏补种工作。<br />" +
                    "血清中特异性IgG抗体定量检测是免疫效果监测最简单易行的方法。<br />" +
                    "SERION ELISA Classic的免疫试剂可用于检测IgG抗体亲和力水平，特别适用于监测抗体保护水平。"],
                    ["·安全性：实验操作时应严格按照实验室生物、化学安全规定进行。<br />" +
                    "·用途：本产品仅供于科研或体外诊断用，不能用于人体实验或治疗。"],
                    ["ESR1201G", "百日咳毒素 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR120G", "百日咳杆菌 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR130G", "白喉杆菌 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR102G", "麻疹病毒 lgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR103G", "腮腺炎病毒 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],

                    ["ESR108G", "破伤风杆菌 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR104G", "水痘-带状疱疹病毒 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                        ["ESR129G", "风疹病毒 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"]

                ],
                // TORCH系列（13）
                [
                    ["妊娠期传染病的抗体水平监测，有利于评估孕妇的免疫状态，区分是原发感染还是既往感染，同时为产前诊断胎儿宫内感染寻找手术指征。"],
                    [""],
                    ["ESR110G", "弓形虫 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR110M", "弓形虫 IgM抗体检测试剂盒", "酶联免疫法", "定量检测/<br />定性检测", "96T"],
                    ["ESR129G", "风疹病毒 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR129M", "风疹病毒 IgM抗体检测试剂盒", "酶联免疫法", "定量检测/<br />定性检测", "96T"],
                    ["ESR109G", "巨细胞病毒 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR109M", "巨细胞病毒 IgM抗体检测试剂盒", "酶联免疫法", "定量检测/<br />定性检测", "96T"],
                    ["ESR105A", "单纯疱疹病毒1+2型 IgA抗体检测试剂盒", "酶联免疫法", "定量检测/<br />定性检测", "96T"],
                    ["ESR105G", "单纯疱疹病毒1+2型 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR105M", "单纯疱疹病毒1+2型 IgM抗体检测试剂盒", "酶联免疫法", "定量检测/<br />定性检测", "96T"],
                    ["ESR1051G", "单纯疱疹病毒1型 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1051M", "单纯疱疹病毒1型 IgM抗体检测试剂盒", "酶联免疫法", "定量检测/<br />定性检测", "96T"],
                    ["ESR1052G", "单纯疱疹病毒2型 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1052M", "单纯疱疹病毒2型 IgM抗体检测试剂盒", "酶联免疫法", "定量检测/<br />定性检测", "96T"]
                ],
                // 儿童疾病系列（56）
                [
                    ["儿童阶段发生的传染病具有较强的传染性。<br />" +
                    "全球每年约有 1300万名儿童由于感染性疾病而死亡，是导致儿童死亡或残疾的第一原因。<br />" +
                    "相关的疾病包括手足口病、呼吸道病毒感染、麻风腮、百白破和传染性单核细胞增多症等。"],
                    [""],
                    ["ESR1201A", "百日咳毒素 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1201G", "百日咳毒素 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR120A", "百日咳杆菌 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR120G", "百日咳杆菌 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR120M", "百日咳杆菌 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR130G", "白喉杆菌 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR108G", "破伤风杆菌 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR102G", "麻疹病毒 lgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR102M", "麻疹病毒 lgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR129G", "风疹病毒 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR129M", "风疹病毒 IgM抗体检测试剂盒", "酶联免疫法", "定量检测/<br />定性检测", "96T"],
                    ["ESR103G", "腮腺炎病毒 lgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR103M", "腮腺炎病毒 lgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR122G", "细小病毒B19 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR122M", "细小病毒B19 IgM抗体检测试剂盒", "酶联免疫法", "定量检测/<br />定性检测", "96T"],
                    ["ESR104A", "水痘-带状疱疹病毒 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR104G", "水痘-带状疱疹病毒 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR104M", "水痘-带状疱疹病毒 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1231A", "流感病毒A型 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1231G", "流感病毒A型 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1231M", "流感病毒A型 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1232A", "流感病毒B型 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1232G", "流感病毒B型 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1232M", "流感病毒B型 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1362G", "EB病毒 EBNA1 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1361G", "EB病毒 VCA IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1361M", "EB病毒 VCA IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1363G", "EB病毒早期 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR113A", "呼吸道合胞病毒 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR113G", "呼吸道合胞病毒 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR113M", "呼吸道合胞病毒 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR134A", "柯萨奇病毒 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR134G", "柯萨奇病毒 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR134M", "柯萨奇病毒 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR135A", "埃可病毒 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR135G", "埃可病毒 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR135M", "埃可病毒 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR133A", "肠道病毒 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR133G", "肠道病毒 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR133M", "肠道病毒 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR126A", "副流感病毒 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR126G", "副流感病毒 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1371A", "肺炎衣原体 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1371G", "肺炎衣原体 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1371M", "肺炎衣原体 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR127A", "肺炎支原体 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR127G", "肺炎支原体 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR127M", "肺炎支原体 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR128A", "腺病毒 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR128G", "腺病毒 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR128M", "腺病毒 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR139A", "空肠弯曲杆菌 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR139G", "空肠弯曲杆菌 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR139M", "空肠弯曲杆菌 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"]
                ],
                // 皮肤性病系列（5）
                [
                    ["性病是在世界范围内广泛流行的一组常见传染病，并呈现流行范围扩大、发病年龄降低、耐药菌株增多的趋势，已成为严重的公共健康问题。<br />" +
                    "在进行HIV筛查的同时，建议增加单纯疱疹项目的检测。"],
                    [""],
                    ["ESR105A", "单纯疱疹病毒1+2型 IgA抗体检测试剂盒", "酶联免疫法", "定量检测/<br />定性检测", "96T"],
                    ["ESR1051G", "单纯疱疹病毒1型 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1051M", "单纯疱疹病毒1型 IgM抗体检测试剂盒", "酶联免疫法", "定量检测/<br />定性检测", "96T"],
                    ["ESR1052G", "单纯疱疹病毒2型 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1052M", "单纯疱疹病毒2型 IgM抗体检测试剂盒", "酶联免疫法", "定量检测/<br />定性检测", "96T"]
                ],
                // 疱疹病毒系列（12）
                [
                    ["疱疹病毒是已知的亚型最多的病毒，结构复杂。病毒主要侵犯外胚层来源的组织，包括皮肤、粘膜和神经组织。<br />" +
                    "感染部位和引起的疾病多种多样，并有潜伏感染的趋势，严重影响人类健康。"],
                    [""],
                    ["ESR1051G", "单纯疱疹病毒1型 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1051M", "单纯疱疹病毒1型 IgM抗体检测试剂盒", "酶联免疫法", "定量检测/<br />定性检测", "96T"],
                    ["ESR1052G", "单纯疱疹病毒2型 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1052M", "单纯疱疹病毒2型 IgM抗体检测试剂盒", "酶联免疫法", "定量检测/<br />定性检测", "96T"],
                    ["ESR105A", "单纯疱疹病毒1+2型 IgA抗体检测试剂盒", "酶联免疫法", "定量检测/<br />定性检测", "96T"],
                    ["ESR105G", "单纯疱疹病毒1+2型 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR105M", "单纯疱疹病毒1+2型 IgM抗体检测试剂盒", "酶联免疫法", "定量检测/<br />定性检测", "96T"],
                    ["ESR104A", "水痘-带状疱疹病毒 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR104G", "水痘-带状疱疹病毒 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR104M", "水痘-带状疱疹病毒 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR109G", "巨细胞病毒 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR109M", "巨细胞病毒 IgM抗体检测试剂盒", "酶联免疫法", "定量检测/<br />定性检测", "96T"]
                ],
                // 呼吸道疾病系列（39）
                [
                    ["呼吸道感染，特别是由细菌和病毒引起的传染病，是在世界范围内最常见的疾病。<br />" +
                    "及时、准确检测各类呼吸道传染病，对流行病学调查、日常监测和科学研究具有重要意义。"],
                    [""],
                    ["ESR113A", "呼吸道合胞病毒 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR113G", "呼吸道合胞病毒 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR113M", "呼吸道合胞病毒 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1371A", "肺炎衣原体 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1371G", "肺炎衣原体 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1371M", "肺炎衣原体 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR127A", "肺炎支原体 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR127G", "肺炎支原体 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR127M", "肺炎支原体 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR128A", "腺病毒 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR128G", "腺病毒 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR128M", "腺病毒 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR106G", "嗜肺军团菌1-7 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR106M", "嗜肺军团菌1-7 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1231A", "流感病毒A型 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1231G", "流感病毒A型 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1231M", "流感病毒A型 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1232A", "流感病毒B型 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1232G", "流感病毒B型 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1232M", "流感病毒B型 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR134A", "柯萨奇病毒 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR134G", "柯萨奇病毒 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR134M", "柯萨奇病毒 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR135A", "埃可病毒 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR135G", "埃可病毒 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR135M", "埃可病毒 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1201A", "百日咳毒素 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1201G", "百日咳毒素 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR120A", "百日咳杆菌 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR120G", "百日咳杆菌 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR120M", "百日咳杆菌 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR133A", "肠道病毒 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR133G", "肠道病毒 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR133M", "肠道病毒 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1312G", "Q热立克次体2相 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1312M", "Q热立克次体2相 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR126A", "副流感病毒 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR126G", "副流感病毒 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"]
                ],
                // 胃肠道疾病系列（15）
                [
                    ["胃肠道疾病是由多种细菌或病毒感染引起，全球发病率约20%。"],
                    [""],
                    ["ESR139A", "空肠弯曲杆菌 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR139G", "空肠弯曲杆菌 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR139M", "空肠弯曲杆菌 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR134A", "柯萨奇病毒 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR134G", "柯萨奇病毒 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR134M", "柯萨奇病毒 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR135A", "埃可病毒 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR135G", "埃可病毒 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR135M", "埃可病毒 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR133A", "肠道病毒 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR133G", "肠道病毒 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR133M", "肠道病毒 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR118A", "幽门螺旋杆菌 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR118G", "幽门螺旋杆菌 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR118M", "幽门螺旋杆菌 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"]
                ],
                // 鼻咽癌相关病毒系列（6）
                [
                    ["鼻咽癌是我国高发恶性肿瘤之一，发病率位于耳鼻咽喉恶性肿瘤之首。<br />" +
                    "大量研究表明EBV与鼻咽癌的发生、发展密切相关。EBV血清学检查是鼻咽癌监测的重要手段。"],
                    [""],
                    ["ESR1362G", "EB病毒 EBNA1 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1361A", "EB病毒 VCA IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1361G", "EB病毒 VCA IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1361M", "EB病毒 VCA IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1363A", "EB病毒早期 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1363G", "EB病毒早期 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"]
                ],
                // 人畜共患系列（20）
                [
                    ["人畜共患病是在人类和动物之间自然传播的疾病。病原体包括病毒、细菌、真菌、支原体、衣原体、立克次氏体、螺旋体、寄生虫等。<br />" +
                    "近年来，人畜共患病在全球呈上升趋势，严重影响我国的公共卫生安全。"],
                    [""],
                    ["ESR121G", "伯氏疏螺旋体 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR121M", "伯氏疏螺旋体 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR116A", "布鲁氏杆菌 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR116G", "布鲁氏杆菌 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR116M", "布鲁氏杆菌 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR139A", "空肠弯曲杆菌 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR139G", "空肠弯曲杆菌 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR139M", "空肠弯曲杆菌 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1311A", "Q热立克次体1相 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1312G", "Q热立克次体2相 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1312M", "Q热立克次体2相 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR107G", "棘球绦虫 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR142G", "土拉热弗朗西丝氏菌 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR142M", "土拉热弗朗西丝氏菌 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR112G", "蜱传脑炎病毒 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR112M", "蜱传脑炎病毒 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR125G", "钩端螺旋体 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR110G", "弓形虫 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR110M", "弓形虫 IgM抗体检测试剂盒", "酶联免疫法", "定量检测/<br />定性检测", "96T"],
                    ["ESR147G", "利什曼原虫 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"]
                ],
                // 虫媒传染系列（6）
                [
                    ["虫媒传染病是由病媒生物传播的疾病。<br />" +
                    "危害性较强的虫媒传染病包括流行性乙型脑炎、鼠疫、莱姆病、疟疾、登革热等。"],
                    [""],
                    ["ESR142G", "土拉热弗朗西丝氏菌 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR142M", "土拉热弗朗西丝氏菌 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR112G", "蜱传脑炎病毒 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR112M", "蜱传脑炎病毒 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR114G", "登革热病毒 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR114M", "登革热病毒 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"]
                ],
                // 衣原体感染系列（6）
                [
                    ["沙眼衣原体主要寄生于机体粘膜的上皮细胞，在眼睛粘膜、呼吸道和生殖系统引起病变。<br />" +
                    "未经治疗的衣原体感染可导致失明、不育和关节炎。肺炎衣原体可以引起慢性支气管炎和肺炎。"],
                    [""],
                    ["ESR1371A", "肺炎衣原体 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1371G", "肺炎衣原体 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1371M", "肺炎衣原体 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1372A", "沙眼衣原体 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1372G", "沙眼衣原体 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR1372M", "沙眼衣原体 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"]
                ],
                // 真菌感染系列（7）
                [
                    ["真菌感染疾病是由真菌感染引起，主要分为曲霉菌病、念珠菌病和隐球菌病等。<br />" +
                    "高风险患者的免疫功能低下，易发生深部真菌感染，对健康和生命构成严重威胁。<br />" +
                    "曲霉菌属和念珠菌的特异性抗体检测，对预防、监测真菌感染具有重要作用。"],
                    [""],
                    ["ESR132A", "烟曲霉菌 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR132G", "烟曲霉菌 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR132M", "烟曲霉菌 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR117A", "白色念珠菌 IgA抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR117G", "白色念珠菌 IgG抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR117M", "白色念珠菌 IgM抗体检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["ESR200", "白色念珠菌抗原检测试剂盒", "酶联免疫法", "定量检测", "96T"]
                ],
                // IgG抗体亲和力检测
                [
                    ["亲和力检测试剂可用于测定病原体的特异性IgG抗体的亲和力。<br />" +
                    "测定孕妇的产前血清IgG抗体亲和力，可区分原发感染和既往感染。"],
                    [""],
                    ["B129AVID", "风疹病毒IgG亲和力检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["B110AVID", "弓形虫IgG亲和力检测试剂盒", "酶联免疫法", "定量检测", "96T"],
                    ["B109AVID", "巨细胞病毒IgG亲和力检测试剂盒", "酶联免疫法", "定量检测", "96T"]
                ],
                // 类风湿因子吸附剂
                [
                    [],

                ]
            ],
            // 1 质控品
            [

                // 免疫效果监测系列（5）
                [
                    [""],
                    ["·安全性：实验操作时应严格按照实验室生物、化学安全规定进行。<br />" +
                    "·用途：本产品仅供于科研或体外诊断用，不能用于人体实验或治疗。"],
                    ["BC102G", "麻疹病毒 IgG抗体检测质控品", "Measles Virus IgG control", "液体即用型", "3 mL/支"],
                    ["BC102M", "麻疹病毒 IgM抗体检测质控品", "Measles Virus IgM control", "液体即用型", "3 mL/支"],
                    ["BC103G", "腮腺炎病毒 IgG抗体检测质控品", "Mumps Virus IgG control", "液体即用型", "3 mL/支"],
                    ["BC103M", "腮腺炎病毒 IgM抗体检测质控品", "Mumps Virus IgM control", "液体即用型", "3 mL/支"],
                    ["BC104A", "水痘-带状疱疹病毒 IgA抗体检测质控品", "Varicella-Zoster Virus IgA control", "液体即用型", "3 mL/支"],
                    ["BC108G", "破伤风杆菌 IgG抗体检测质控品", "Tetanus IgG control control", "液体即用型", "3 mL/支"],
                    ["BC1201A", "百日咳杆菌毒素 IgA抗体检测质控品", "Bordetella pertussis Toxin IgA  control", "液体即用型", "3 mL/支"],
                    ["BC1201G", "百日咳杆菌毒素 IgG抗体检测质控品", "Bordetella pertussis Toxin IgG  control", "液体即用型", "3 mL/支"],
                    ["BC120A", "百日咳杆菌 IgA抗体检测质控品", "Bordetella pertussis IgA  control", "液体即用型", "3 mL/支"],
                    ["BC120G", "百日咳杆菌 IgG抗体检测质控品", "Bordetella pertussis IgG  control", "液体即用型", "3 mL/支"],
                    ["BC129G", "风疹病毒 IgG抗体检测质控品", "Rubella Virus IgG control", "液体即用型", "3 mL/支"],
                    ["BC129M", "风疹病毒 IgM抗体检测质控品", "Rubella Virus IgM control", "液体即用型", "3 mL/支"],
                    ["BC130G", "白喉杆菌 IgG抗体检测质控品", "Diphtherie IgG control", "液体即用型", "3 mL/支"]

                ],
                // TORCH系列（14）
                [
                    [""],
                    [""],
                    ["BC1051G", "单纯疱疹病毒1型IgG抗体检测质控品", "Herpes Simplex Virus 1  IgG control", "液体即用型", "3 mL/支"],
                    ["BC1051M", "单纯疱疹病毒1型IgM抗体检测质控品", "Herpes Simplex Virus 1  IgM control", "液体即用型", "3 mL/支"],
                    ["BC1052G", "单纯疱疹病毒2型IgG抗体检测质控品", "Herpes Simplex Virus 2  IgG control", "液体即用型", "3 mL/支"],
                    ["BC1052M", "单纯疱疹病毒2型IgM抗体检测质控品", "Herpes Simplex Virus 2  IgM control", "液体即用型", "3 mL/支"],
                    ["BC105A", "单纯疱疹病毒1+2型IgA抗体检测质控品", "Herpes Simplex Virus 1+2 IgA control", "液体即用型", "3 mL/支"],
                    ["BC105G", "单纯疱疹病毒1+2型IgG抗体检测质控品", "Herpes Simplex Virus 1+2 IgG control", "液体即用型", "3 mL/支"],
                    ["BC105M", "单纯疱疹病毒1+2型IgM抗体检测质控品", "Herpes Simplex Virus 1+2 IgM control", "液体即用型", "3 mL/支"],
                    ["BC109G", "巨细胞 IgG抗体检测质控品", "Cytomegalovirus IgG control", "液体即用型", "3 mL/支"],
                    ["BC109M", "巨细胞 IgM抗体检测质控品", "Cytomegalovirus IgM control", "液体即用型", "3 mL/支"],
                    ["BC110G", "刚地弓形虫 IgG抗体检测质控品", "Toxoplasma Gondii  IgG control", "液体即用型", "3 mL/支"],
                    ["BC110M", "刚地弓形虫 IgM抗体检测质控品", "Toxoplasma Gondii  IgM control", "液体即用型", "3 mL/支"],
                    ["BC129G", "风疹病毒 IgG抗体检测质控品", "Rubella Virus IgG control", "液体即用型", "3 mL/支"],
                    ["BC129M", "风疹病毒 IgM抗体检测质控品", "Rubella Virus IgM control", "液体即用型", "3 mL/支"]
                ],
                // 儿童疾病系列
                [
                    [""],
                    [""],
                    ["BC102G", "麻疹病毒 IgG抗体检测质控品", "Measles Virus IgG control", "液体即用型", "3 mL/支"],
                    ["BC102M", "麻疹病毒 IgM抗体检测质控品", "Measles Virus IgM control", "液体即用型", "3 mL/支"],
                    ["BC103G", "腮腺炎病毒 IgG抗体检测质控品", "Mumps Virus IgG control", "液体即用型", "3 mL/支"],
                    ["BC103M", "腮腺炎病毒 IgM抗体检测质控品", "Mumps Virus IgM control", "液体即用型", "3 mL/支"],
                    ["BC104A", "水痘-带状疱疹病毒 IgA抗体检测质控品", "Varicella-Zoster Virus IgA control", "液体即用型", "3 mL/支"],
                    ["BC108G", "破伤风杆菌 IgG抗体检测质控品", "Tetanus IgG control", "液体即用型", "3 mL/支"],
                    ["BC113A", "呼吸道合胞病毒 IgA抗体检测质控品", "Resp. Syncytial Virus IgA control", "液体即用型", "3 mL/支"],
                    ["BC113G", "呼吸道合胞病毒IgG抗体检测质控品", "Respiratory Syncytial Virus IgG control", "液体即用型", "3 mL/支"],
                    ["BC1201A", "百日咳杆菌毒素 IgA抗体检测质控品", "Bordetella pertussis Toxin IgA  control", "液体即用型", "3 mL/支"],
                    ["BC1201G", "百日咳杆菌毒素 IgG抗体检测质控品", "Bordetella pertussis Toxin IgG  control", "液体即用型", "3 mL/支"],
                    ["BC120A", "百日咳杆菌 IgA抗体检测质控品", "Bordetella pertussis IgA  control", "液体即用型", "3 mL/支"],
                    ["BC120G", "百日咳杆菌 IgG抗体检测质控品", "Bordetella pertussis IgG  control", "液体即用型", "3 mL/支"],
                    ["BC122G", "细小病毒B19 IgG抗体检测质控品", "Parvovirus B19 IgG control", "液体即用型", "3 mL/支"],
                    ["BC122M", "细小病毒B19 IgM抗体检测质控品", "Parvovirus B19 IgM control", "液体即用型", "3 mL/支"],
                    ["BC1231A", "流感病毒A IgA抗体检测质控品", "Influenza A Virus IgA control", "液体即用型", "3 mL/支"],
                    ["BC1231G", "流感病毒A IgG抗体检测质控品", "Influenza A Virus IgG control", "液体即用型", "3 mL/支"],
                    ["BC1231M", "流感病毒A IgM抗体检测质控品", "Influenza A Virus IgM control", "液体即用型", "3 mL/支"],
                    ["BC1232A", "流感病毒B IgA抗体检测质控品", "Influenza B Virus IgA control", "液体即用型", "3 mL/支"],
                    ["BC1232G", "流感病毒B IgG抗体检测质控品", "Influenza B Virus IgG control", "液体即用型", "3 mL/支"],
                    ["BC1232M", "流感病毒B IgM抗体检测质控品", "Influenza B Virus IgM control", "液体即用型", "3 mL/支"],
                    ["BC126A", "副流感病毒IgA抗体检测质控品", "Parainfluenza IgA control", "液体即用型", "3 mL/支"],
                    ["BC126G", "副流感病毒IgG抗体检测质控品", "Parainfluenza IgG control", "液体即用型", "3 mL/支"],
                    ["BC127A", "肺炎支原体 IgA抗体检测质控品", "Mycoplasma pneumoniae IgA control", "液体即用型", "3 mL/支"],
                    ["BC127G", "肺炎支原体 IgG抗体检测质控品", "Mycoplasma pneumoniae IgG control", "液体即用型", "3 mL/支"],
                    ["BC127M", "肺炎支原体 IgM抗体检测质控品", "Mycoplasma pneumoniae IgM control", "液体即用型", "3 mL/支"],
                    ["BC128A", "腺病毒 IgA抗体检测质控品", "Adenovirus IgA control", "液体即用型", "3 mL/支"],
                    ["BC128G", "腺病毒 IgG抗体检测质控品", "Adenovirus IgG control", "液体即用型", "3 mL/支"],
                    ["BC129G", "风疹病毒 IgG抗体检测质控品", "Rubella Virus IgG control", "液体即用型", "3 mL/支"],
                    ["BC129M", "风疹病毒 IgM抗体检测质控品", "Rubella Virus IgM control", "液体即用型", "3 mL/支"],
                    ["BC130G", "白喉杆菌 IgG抗体检测质控品", "Diphtherie IgG control", "液体即用型", "3 mL/支"],
                    ["BC133A", "肠道病毒IgA抗体检测质控品", "Enterovirus IgA control", "液体即用型", "3 mL/支"],
                    ["BC134A", "柯萨奇病毒IgA抗体检测质控品", "Coxsackievirus IgA control", "液体即用型", "3 mL/支"],
                    ["BC134G", "柯萨奇病毒IgG抗体检测质控品", "Coxsackievirus IgG control", "液体即用型", "3 mL/支"],
                    ["BC134M", "柯萨奇病毒 IgM抗体检测质控品", "Coxsackievirus IgM control", "液体即用型", "3 mL/支"],
                    ["BC135A", "埃可病毒IgA抗体检测质控品", "Echovirus IgA control", "液体即用型", "3 mL/支"],
                    ["BC135G", "埃可病毒IgG抗体检测质控品", "Echovirus IgG control", "液体即用型", "3 mL/支"],
                    ["BC135M", "埃可病毒 IgM抗体检测质控品", "Echovirus IgM control", "液体即用型", "3 mL/支"],
                    ["BC1361G", "EB病毒VCA IgG抗体检测质控品", "Epstein-Barr virus VCA IgG control", "液体即用型", "3 mL/支"],
                    ["BC1361M", "EB病毒VCA IgM抗体检测质控品", "Epstein-Barr virus VCA IgM control", "液体即用型", "3 mL/支"],
                    ["BC1362G", "EB病毒NA-1 IgG抗体检测质控品", "Epstein-Barr virus EBNA1 IgG control", "液体即用型", "3 mL/支"],
                    ["BC1363G", "EB病毒早期蛋白IgG抗体检测质控品", "Epstein-Barr virus EA IgG control", "液体即用型", "3 mL/支"],
                    ["BC1371A", "肺炎衣原体IgA抗体检测质控品", "Chlamydia Pneumoniae IgA control", "液体即用型", "3 mL/支"],
                    ["BC1371G", "肺炎衣原体IgG抗体检测质控品", "Chlamydia Pneumoniae IgG control", "液体即用型", "3 mL/支"],
                    ["BC1371M", "肺炎衣原体IgM抗体检测质控品", "Chlamydia Pneumoniae IgM control", "液体即用型", "3 mL/支"],
                    ["BC139A", "空肠弯曲杆菌IgA抗体检测质控品", "Campylobacter jejuni IgA control", "液体即用型", "3 mL/支"],
                    ["BC139G", "空肠弯曲杆菌IgG抗体检测质控品", "Campylobacter jejuni IgG control", "液体即用型", "3 mL/支"],
                    ["BC139M", "空肠弯曲杆菌IgM抗体检测质控品", "Campylobacter jejuni IgM control", "液体即用型", "3 mL/支"]
                ],
                // 皮肤性病系列
                [
                    [""],
                    [""],
                    ["BC1051G", "单纯疱疹病毒1型IgG抗体检测质控品", "Herpes Simplex Virus 1  IgG control", "液体即用型", "3 mL/支"],
                    ["BC1051M", "单纯疱疹病毒1型IgM抗体检测质控品", "Herpes Simplex Virus 1  IgM control", "液体即用型", "3 mL/支"],
                    ["BC1052G", "单纯疱疹病毒2型IgG抗体检测质控品", "Herpes Simplex Virus 2  IgG control", "液体即用型", "3 mL/支"],
                    ["BC1052M", "单纯疱疹病毒2型IgM抗体检测质控品", "Herpes Simplex Virus 2  IgM control", "液体即用型", "3 mL/支"],
                    ["BC105A", "单纯疱疹病毒1+2型IgA抗体检测质控品", "Herpes Simplex Virus 1+2 IgA control", "液体即用型", "3 mL/支"],
                    ["BC105G", "单纯疱疹病毒1+2型IgG抗体检测质控品", "Herpes Simplex Virus 1+2 IgG control", "液体即用型", "3 mL/支"],
                    ["BC105M", "单纯疱疹病毒1+2型IgM抗体检测质控品", "Herpes Simplex Virus 1+2 IgM control", "液体即用型", "3 mL/支"]
                ],
                // 疱疹病毒系列
                [
                    [""],
                    [""],
                    ["BC104A", "水痘-带状疱疹病毒 IgA抗体检测质控品", "Varicella-Zoster Virus IgA control", "液体即用型", "3 mL/支"],
                    ["BC1051G", "单纯疱疹病毒1型IgG抗体检测质控品", "Herpes Simplex Virus 1  IgG control", "液体即用型", "3 mL/支"],
                    ["BC1051M", "单纯疱疹病毒1型IgM抗体检测质控品", "Herpes Simplex Virus 1  IgM control", "液体即用型", "3 mL/支"],
                    ["BC1052G", "单纯疱疹病毒2型IgG抗体检测质控品", "Herpes Simplex Virus 2  IgG control", "液体即用型", "3 mL/支"],
                    ["BC1052M", "单纯疱疹病毒2型IgM抗体检测质控品", "Herpes Simplex Virus 2  IgM control", "液体即用型", "3 mL/支"],
                    ["BC105A", "单纯疱疹病毒1+2型IgA抗体检测质控品", "Herpes Simplex Virus 1+2 IgA control", "液体即用型", "3 mL/支"],
                    ["BC105G", "单纯疱疹病毒1+2型IgG抗体检测质控品", "Herpes Simplex Virus 1+2 IgG control", "液体即用型", "3 mL/支"],
                    ["BC105M", "单纯疱疹病毒1+2型IgM抗体检测质控品", "Herpes Simplex Virus 1+2 IgM control", "液体即用型", "3 mL/支"],
                    ["BC109G", "巨细胞 IgG抗体检测质控品", "Cytomegalovirus IgG control", "液体即用型", "3 mL/支"],
                    ["BC109M", "巨细胞 IgM抗体检测质控品", "Cytomegalovirus IgM control", "液体即用型", "3 mL/支"]
                ],
                // 呼吸道疾病系列
                [
                    [""],
                    [""],
                    ["BC106G", "嗜肺军团菌1-7 IgG抗体检测质控品", "Legionella pneumophila 1-7 IgG control", "液体即用型", "3 mL/支"],
                    ["BC113A", "呼吸道合胞病毒 IgA抗体检测质控品", "Resp. Syncytial Virus IgA control", "液体即用型", "3 mL/支"],
                    ["BC113G", "呼吸道合胞病毒IgG抗体检测质控品", "Respiratory Syncytial Virus IgG control", "液体即用型", "3 mL/支"],
                    ["BC1201A", "百日咳杆菌毒素 IgA抗体检测质控品", "Bordetella pertussis Toxin IgA  control", "液体即用型", "3 mL/支"],
                    ["BC1201G", "百日咳杆菌毒素 IgG抗体检测质控品", "Bordetella pertussis Toxin IgG  control", "液体即用型", "3 mL/支"],
                    ["BC120A", "百日咳杆菌 IgA抗体检测质控品", "Bordetella pertussis IgA  control", "液体即用型", "3 mL/支"],
                    ["BC120G", "百日咳杆菌 IgG抗体检测质控品", "Bordetella pertussis IgG  control", "液体即用型", "3 mL/支"],
                    ["BC1231A", "流感病毒A IgA抗体检测质控品", "Influenza A Virus IgA control", "液体即用型", "3 mL/支"],
                    ["BC1231G", "流感病毒A IgG抗体检测质控品", "Influenza A Virus IgG control", "液体即用型", "3 mL/支"],
                    ["BC1231M", "流感病毒A IgM抗体检测质控品", "Influenza A Virus IgM control", "液体即用型", "3 mL/支"],
                    ["BC1232A", "流感病毒B IgA抗体检测质控品", "Influenza B Virus IgA control", "液体即用型", "3 mL/支"],
                    ["BC1232G", "流感病毒B IgG抗体检测质控品", "Influenza B VirusIgG control", "液体即用型", "3 mL/支"],
                    ["BC1232M", "流感病毒B IgM抗体检测质控品", "Influenza B Virus IgM control", "液体即用型", "3 mL/支"],
                    ["BC126A", "副流感病毒IgA抗体检测质控品", "Parainfluenza IgA control", "液体即用型", "3 mL/支"],
                    ["BC126G", "副流感病毒IgG抗体检测质控品", "Parainfluenza IgG control", "液体即用型", "3 mL/支"],
                    ["BC127A", "肺炎支原体 IgA抗体检测质控品", "Mycoplasma pneumoniae IgA control", "液体即用型", "3 mL/支"],
                    ["BC127G", "肺炎支原体 IgG抗体检测质控品", "Mycoplasma pneumoniae IgG control", "液体即用型", "3 mL/支"],
                    ["BC127M", "肺炎支原体 IgM抗体检测质控品", "Mycoplasma pneumoniae IgM control", "液体即用型", "3 mL/支"],
                    ["BC128A", "腺病毒 IgA抗体检测质控品", "Adenovirus IgA control", "液体即用型", "3 mL/支"],
                    ["BC128G", "腺病毒 IgG抗体检测质控品", "Adenovirus IgG control", "液体即用型", "3 mL/支"],
                    ["BC1312G", "Q热柯克斯体2相IgG抗体检测质控品", "Coxiella burnetii phase 2 (Q-Fieber) IgG control", "液体即用型", "3 mL/支"],
                    ["BC1312M", "Q热柯克斯体2相IgM抗体检测质控品", "Coxiella burnetii phase 2 (Q-Fieber) IgM control", "液体即用型", "3 mL/支"],
                    ["BC133A", "肠道病毒IgA抗体检测质控品", "Enterovirus IgA control", "液体即用型", "3 mL/支"],
                    ["BC133G", "肠道病毒IgG抗体检测质控品", "Enterovirus IgG control", "液体即用型", "3 mL/支"],
                    ["BC133M", "肠道病毒IgM抗体检测质控品", "Enterovirus IgM control", "液体即用型", "3 mL/支"],
                    ["BC134A", "柯萨奇病毒IgA抗体检测质控品", "Coxsackievirus IgA control", "液体即用型", "3 mL/支"],
                    ["BC134G", "柯萨奇病毒IgG抗体检测质控品", "Coxsackievirus IgG control", "液体即用型", "3 mL/支"],
                    ["BC134M", "柯萨奇病毒 IgM抗体检测质控品", "Coxsackievirus IgM control", "液体即用型", "3 mL/支"],
                    ["BC135A", "埃可病毒IgA抗体检测质控品", "Echovirus IgA control", "液体即用型", "3 mL/支"],
                    ["BC135G", "埃可病毒IgG抗体检测质控品", "Echovirus IgG control", "液体即用型", "3 mL/支"],
                    ["BC135M", "埃可病毒 IgM抗体检测质控品", "Echovirus IgM control", "液体即用型", "3 mL/支"],
                    ["BC1371A", "肺炎衣原体IgA抗体检测质控品", "Chlamydia Pneumoniae IgA control", "液体即用型", "3 mL/支"],
                    ["BC1371G", "肺炎衣原体IgG抗体检测质控品", "Chlamydia Pneumoniae IgG control", "液体即用型", "3 mL/支"],
                    ["BC1371M", "肺炎衣原体IgM抗体检测质控品", "Chlamydia Pneumoniae IgM control", "液体即用型", "3 mL/支"]
                ],
                // 胃肠道疾病系列
                [
                    [""],
                    [""],
                    ["BC118A", "幽门螺旋杆菌 IgA抗体检测质控品", "Helicobacter pylori IgA  control", "液体即用型", "3 mL/支"],
                    ["BC118G", "幽门螺旋杆菌 IgG抗体检测质控品", "Helicobacter pylori IgG  control", "液体即用型", "3 mL/支"],
                    ["BC118M", "幽门螺旋杆菌 IgM抗体检测质控品", "Helicobacter pylori IgM  control", "液体即用型", "3 mL/支"],
                    ["BC133A", "肠道病毒IgA抗体检测质控品", "Enterovirus IgA control", "液体即用型", "3 mL/支"],
                    ["BC133G", "肠道病毒IgG抗体检测质控品", "Enterovirus IgG control", "液体即用型", "3 mL/支"],
                    ["BC133M", "肠道病毒IgM抗体检测质控品", "Enterovirus IgM control", "液体即用型", "3 mL/支"],
                    ["BC134A", "柯萨奇病毒IgA抗体检测质控品", "Coxsackievirus IgA control", "液体即用型", "3 mL/支"],
                    ["BC134G", "柯萨奇病毒IgG抗体检测质控品", "Coxsackievirus IgG control", "液体即用型", "3 mL/支"],
                    ["BC134M", "柯萨奇病毒 IgM抗体检测质控品", "Coxsackievirus IgM control", "液体即用型", "3 mL/支"],
                    ["BC135A", "埃可病毒IgA抗体检测质控品", "Echovirus IgA control", "液体即用型", "3 mL/支"],
                    ["BC135G", "埃可病毒IgG抗体检测质控品", "Echovirus IgG control", "液体即用型", "3 mL/支"],
                    ["BC135M", "埃可病毒 IgM抗体检测质控品", "Echovirus IgM control", "液体即用型", "3 mL/支"],
                    ["BC139A", "空肠弯曲杆菌IgA抗体检测质控品", "Campylobacter jejuni IgA control", "液体即用型", "3 mL/支"],
                    ["BC139G", "空肠弯曲杆菌IgG抗体检测质控品", "Campylobacter jejuni IgG control", "液体即用型", "3 mL/支"],
                    ["BC139M", "空肠弯曲杆菌IgM抗体检测质控品", "Campylobacter jejuni IgM control", "液体即用型", "3 mL/支"]
                ],

                //鼻咽癌相关病毒系列
                [
                    [""],
                    [""],
                    ["BC1361G", "EB病毒VCA IgG抗体检测质控品", "Epstein-Barr virus VCA IgG control", "液体即用型", "3 mL/支"],
                    ["BC1361M", "EB病毒VCA IgM抗体检测质控品", "Epstein-Barr virus VCA IgM control", "液体即用型", "3 mL/支"],
                    ["BC1362G", "EB病毒NA-1 IgG抗体检测质控品", "Epstein-Barr virus EBNA1 IgG control", "液体即用型", "3 mL/支"],
                    ["BC1363G", "EB病毒早期蛋白IgG抗体检测质控品", "Epstein-Barr virus EA IgG control", "液体即用型", "3 mL/支"]
                ],
                // 人畜共患系列
                [
                    [""],
                    [""],
                    ["BC107G", "棘球绦虫IgG 抗体检测质控品", "Echinococcus IgG control", "液体即用型", "3 mL/支"],
                    ["BC110G", "刚地弓形虫 IgG抗体检测质控品", "Toxoplasma Gondii IgG control", "液体即用型", "3 mL/支"],
                    ["BC110M", "刚地弓形虫 IgM抗体检测质控品", "Toxoplasma Gondii IgM control", "液体即用型", "3 mL/支"],
                    ["BC112G", "蜱传脑炎病毒IgG抗体检测质控品", "Tick-borne Encephalitis Virus IgG control", "液体即用型", "3 mL/支"],
                    ["BC112M", "蜱传脑炎病毒IgM抗体检测质控品", "Tick-borne Encephalitis Virus IgM control", "液体即用型", "3 mL/支"],
                    ["BC116A", "布鲁氏杆菌IgA抗体检测质控品", "Brucella IgA control", "液体即用型", "3 mL/支"],
                    ["BC116G", "布鲁氏杆菌IgG抗体检测质控品", "Brucella IgG control", "液体即用型", "3 mL/支"],
                    ["BC116M", "布鲁氏杆菌IgM抗体检测质控品", "Brucella IgM control", "液体即用型", "3 mL/支"],
                    ["BC121G", "伯氏疏螺旋体IgG抗体检测质控品", "Borrelia burgdorferi IgG control", "液体即用型", "3 mL/支"],
                    ["BC121M", "伯氏疏螺旋体IgM抗体检测质控品", "Borrelia burgdorferi IgM control", "液体即用型", "3 mL/支"],
                    ["BC125G", "钩端螺旋体IgG抗体检测质控品", "Leptospira IgG control", "液体即用型", "3 mL/支"],
                    ["BC125M", "钩端螺旋体IgM抗体检测质控品", "Leptospira IgM control", "液体即用型", "3 mL/支"],
                    ["BC1312G", "Q热柯克斯体2相IgG抗体检测质控品", "Coxiella burnetii phase 2 (Q-Fieber) IgG control", "液体即用型", "3 mL/支"],
                    ["BC1312M", "Q热柯克斯体2相IgM抗体检测质控品", "Coxiella burnetii phase 2  (Q-Fieber) IgM control", "液体即用型", "3 mL/支"],
                    ["BC139A", "空肠弯曲杆菌IgA抗体检测质控品", "Campylobacter jejuni IgA control", "液体即用型", "3 mL/支"],
                    ["BC139G", "空肠弯曲杆菌IgG抗体检测质控品", "Campylobacter jejuni IgG control", "液体即用型", "3 mL/支"],
                    ["BC139M", "空肠弯曲杆菌IgM抗体检测质控品", "Campylobacter jejuni IgM control", "液体即用型", "3 mL/支"]
                ],
                // 虫媒传染系列
                [
                    [""],
                    [""],
                    ["BC112G", "蜱传脑炎病毒IgG抗体检测质控品", "Tick-borne Encephalitis Virus IgG control", "液体即用型", "3 mL/支"],
                    ["BC112M", "蜱传脑炎病毒IgM抗体检测质控品", "Tick-borne Encephalitis Virus IgM control", "液体即用型", "3 mL/支"]
                ],
                // 衣原体感染系列
                [
                    [""],
                    [""],
                    ["BC1371A", "肺炎衣原体IgA抗体检测质控品", "Chlamydia Pneumoniae IgA control", "液体即用型", "3 mL/支"],
                    ["BC1371G", "肺炎衣原体IgG抗体检测质控品", "Chlamydia Pneumoniae IgG control", "液体即用型", "3 mL/支"],
                    ["BC1371M", "肺炎衣原体IgM抗体检测质控品", "Chlamydia Pneumoniae IgM control", "液体即用型", "3 mL/支"],
                    ["BC1372A", "沙眼衣原体IgA抗体检测质控品", "Chlamydia trachomatis IgA control", "液体即用型", "3 mL/支"],
                    ["BC1372G", "沙眼衣原体IgG抗体检测质控品", "Chlamydia trachomatis IgG control", "液体即用型", "3 mL/支"],
                    ["BC1372M", "沙眼衣原体IgM抗体检测质控品", "Chlamydia trachomatis IgM control", "液体即用型", "3 mL/支"]
                ],
                // 真菌感染系列
                [
                    [""],
                    [""],
                    ["BC117A", "白色念珠菌IgA抗体检测质控品", "Candida albicans IgA control", "液体即用型", "3 mL/支"],
                    ["BC117G", "白色念珠菌IgG抗体检测质控品", "Candida albicans IgG control", "液体即用型", "3 mL/支"],
                    ["BC117M", "白色念珠菌IgM抗体检测质控品", "Candida albicans IgM control", "液体即用型", "3 mL/支"],
                    ["BC200", "白色念珠菌抗原检测质控品", "Candida albicans antigen control", "液体即用型", "3 mL/支"],
                    ["BC132A", "烟曲霉菌IgA抗体检测质控品", "Aspergillus fumigat IgA control", "液体即用型", "3 mL/支"],
                    ["BC132G", "烟曲霉菌IgG抗体检测质控品", "Aspergillus fumigat IgG control", "液体即用型", "3 mL/支"],
                    ["BC132M", "烟曲霉菌IgM抗体检测质控品", "Aspergillus fumigat00 IgM control", "液体即用型", "3 mL/支"]
                ]
            ],
        ]
    }
})

// 判断是否通过搜索进入产品页面
var url = window.location.href
// decodeURI解决中文乱码问题
var searchUrl = decodeURI( url.split("?keyword=")[1] )
var searchWord = searchUrl.split("&range=")[0]
var range = searchUrl.split("&range=")[1]
// 检索与搜索字段匹配的Nav
if(searchUrl!= undefined) {

    if (searchWord != "") {
        var i = 0
        var len = vm._data.Nav1.length - 1

        if(range != "all"){
            i = range - 1
            len = range - 1
        }
        for (; i <= len; i++) {
            console.log(vm._data.Nav1[i])
            // 展示第一个标题
            if (vm._data.Nav1[i].indexOf(searchWord) != -1) {
                refreshNav1(i)
            }

            for (var j = 0; j < vm._data.Nav2[i].length; j++) {
                console.log(vm._data.Nav2[i][j])
                // 展示第二个标题
                if (vm._data.Nav2[i][j].indexOf(searchWord) != -1) {
                    refreshNav2(i, j)
                }

                if(vm._data.Nav3[i][j] != undefined) {
                    for (var k = 0; k < vm._data.Nav3[i][j].length; k++) {
                        // 展示第三个标题
                        if (vm._data.Nav3[i][j][k].indexOf(searchWord) != -1) {
                            refreshNav3(i, j, k)
                        }
                    }
                }
            }
        }
    }
}



// 页面初始化时，左侧nav展开的条例
var productsNav = JSON.parse(localStorage.getItem("products"))
// 清空products在localStorage上的缓存
localStorage.setItem("products", null);
if(productsNav != undefined){
    var navLength = productsNav.length
    switch (navLength) {
        case(3):
            refreshNav3(productsNav[0], productsNav[1], productsNav[2])
            break;
        case(2):
            refreshNav2(productsNav[0], productsNav[1])
            break;
        case(1):
            refreshNav1(productsNav[0])
            break;
        default:
            break;
    }
}


function refreshNav1(a) {
    $first = $(".layui-nav-item").eq(a)
    $first.addClass("layui-nav-itemed")
}

function refreshNav2(a, b) {
    $first = $(".layui-nav-item").eq(a)
    $first.addClass("layui-nav-itemed")

    $second = $first.children(".layui-nav-child").eq(b)
    if( $second.children().length > 1)
        $second.addClass("layui-nav-itemed")
    else
        $second.addClass("layui-this")
    $second.trigger("click")
}

function refreshNav3(a, b, c) {

}

